#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТекПользователь = Пользователи.ТекущийПользователь();
	Сотрудник = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекПользователь, "ФизическоеЛицо");
	Статус = Перечисления.МС_СтатусыЗаявкиНаОтпуск.Заявка;
	
	Ответственный = ТекПользователь;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	НачДата = НачалоДня(ДатаНачала);
	
	Движения.МС_ГрафикОтпусков.Записывать = Истина;
	
	Пока НачДата <= НачалоДня(ДатаОкончания) Цикл
		
		НовЗапись = Движения.МС_ГрафикОтпусков.Добавить();
		НовЗапись.Период 		= Дата;
		НовЗапись.Сотрудник 	= Сотрудник;
		НовЗапись.Статус 		= Статус;
		НовЗапись.ДеньПериода 	= НачДата;
		НовЗапись.ВидОтпуска	= Вид;
		
		НачДата = НачалоДня(КонецДня(НачДата) + 100);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если НачалоДня(ДатаНачала) > НачалоДня(ДатаОкончания) Тогда
		Сообщить("Дата начала не может быть больше даты окончания");
		Отказ = Истина;
	КонецЕсли;
	
	Если Пользователи.РолиДоступны("РасширенныйДоступКЗаявкамНаОтпуск")
		ИЛИ Пользователи.ЭтоПолноправныйПользователь() Тогда
		
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РС.Пользователь КАК Пользователь,
		|	РС.ИмеетПравоНаСогласование КАК ИмеетПравоНаСогласование,
		|	РС.ИмеетПравоНаУтверждение КАК ИмеетПравоНаУтверждение,
		|	РС.ИмеетПравоНаОтмену КАК ИмеетПравоНаОтмену,
		|	РС.ИмеетПравоНаВыполнение КАК ИмеетПравоНаВыполнение
		|ИЗ
		|	РегистрСведений.МС_УровеньДоступаКЗаявкамНаОтпуск КАК РС
		|ГДЕ
		|	РС.Пользователь = &Пользователь";
		
		Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
		
		СписокДоступныхСтатусов = Новый Массив;
		СписокДоступныхСтатусов.Добавить(Перечисления.МС_СтатусыЗаявкиНаОтпуск.Заявка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.ИмеетПравоНаСогласование Тогда
				СписокДоступныхСтатусов.Добавить(Перечисления.МС_СтатусыЗаявкиНаОтпуск.Согласована);
			КонецЕсли;
			Если Выборка.ИмеетПравоНаУтверждение Тогда
				СписокДоступныхСтатусов.Добавить(Перечисления.МС_СтатусыЗаявкиНаОтпуск.Утверждена);
			КонецЕсли;
			Если Выборка.ИмеетПравоНаВыполнение Тогда
				СписокДоступныхСтатусов.Добавить(Перечисления.МС_СтатусыЗаявкиНаОтпуск.Выполнена);
			КонецЕсли;
			Если Выборка.ИмеетПравоНаОтмену Тогда
				СписокДоступныхСтатусов.Добавить(Перечисления.МС_СтатусыЗаявкиНаОтпуск.Отменена);
			КонецЕсли;
			
		КонецЕсли;
		
		Если СписокДоступныхСтатусов.Найти(Статус) = Неопределено Тогда
			Сообщить("Нет прав доступа на указанный статус");
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	чСекунд = (КонецДня(ДатаОкончания) - НачалоДня(ДатаНачала)) + 1;
	Длительность = чСекунд / (24*60*60);
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Префикс = "БР-";
КонецПроцедуры

#КонецЕсли